BAS BMEKZU Project/src/Catalogs/СпецификацииНоменклатуры/СпецификацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпецификацииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеКомплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяУслуга</name>
    <comment>Является ли услуга транспортной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмеряетсяТолькоВСуммовомВыражении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаНДС</name>
    <comment>Льгота по НДС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкСтрогогоУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитываетсяПоНоминальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСпецификацияНоменклатуры</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураГТД</name>
    <type>
      <types>CatalogRef.НоменклатураГТД</types>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоАкцизномуНалогу</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ВидПродукции</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыСХПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_УчитыватьВВедомостиДвижения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_Удобрение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_УдобрениеПроцент</name>
    <comment>Процент действующего вещества для удобрения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиницыИзмерения</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/СпецификацииНоменклатуры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборНоменклатуры.Форма.Форма" Тогда
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, "ИсходныеКомплектующие");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ОткрытьФорму(
		"Обработка.ПодборНоменклатуры.Форма.Форма", 
		Новый Структура, 
		ЭтаФорма, 
		УникальныйИдентификатор);
		
КонецПроцедуры
	
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
   ПриИзмененииНоменклатурыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	
	ПриИзмененииЕдиницыИзмеренияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходныеКомплектующиеНоменклатураПриИзменении(Элемент)
	
	ИсходныеКомплектующиеПриИзмененииНоменклатурыСервер(Элементы.ИсходныеКомплектующие.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходныеКомплектующиеЕдиницаИзмеренияПриИзменении(Элемент)
	
	ИсходныеКомплектующиеПриИзмененииЕдиницыИзмеренияСервер(Элементы.ИсходныеКомплектующие.ТекущаяСтрока)
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ИмяТаблицы)
	
	ПодобранныеМатериалы = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	Для Каждого СтрокаТовара Из ПодобранныеМатериалы Цикл
		
		СтруктураОтбора = Новый Структура("Номенклатура, ЕдиницаИзмерения", СтрокаТовара.Номенклатура, СтрокаТовара.ЕдиницаИзмерения);
		СтрокаТабличнойЧасти = НайтиСтрокуТабличнойЧасти(ИмяТаблицы, СтруктураОтбора);
		
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			// Нашли - увеличиваем количество.
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + СтрокаТовара.Количество;
			
		Иначе
			
			СтрокаТабличнойЧасти = Объект[ИмяТаблицы].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТовара);
			
		КонецЕсли;
		

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиСтрокуТабличнойЧасти(ИмяТабличнойЧасти, СтруктураОтбора)

	СтрокаТабличнойЧасти = Неопределено;

	МассивНайденныхСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		// Нашли. Вернем первую найденную строку.
		СтрокаТабличнойЧасти = МассивНайденныхСтрок[0];
	КонецЕсли;

	Возврат СтрокаТабличнойЧасти;

КонецФункции

&НаСервере
Процедура ПриИзмененииНоменклатурыСервер()
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.ЕдиницаИзмерения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "БазоваяЕдиницаИзмерения").БазоваяЕдиницаИзмерения;
		Объект.Коэффициент = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЕдиницыИзмеренияСервер()
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Объект.Коэффициент = Справочники.Номенклатура.ПолучитьКоэффициентЕдиницыИзмерения(Объект.Владелец, Объект.ЕдиницаИзмерения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсходныеКомплектующиеПриИзмененииНоменклатурыСервер(ТекущаяСтрока)
	
	СтрокаТЧ = Объект.ИсходныеКомплектующие.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если СтрокаТЧ <> Неопределено И ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "БазоваяЕдиницаИзмерения");
		СтрокаТЧ.Коэффициент = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсходныеКомплектующиеПриИзмененииЕдиницыИзмеренияСервер(ТекущаяСтрока)
	
	СтрокаТЧ = Объект.ИсходныеКомплектующие.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если СтрокаТЧ <> Неопределено И ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) Тогда
		СтрокаТЧ.Коэффициент = Справочники.Номенклатура.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТЧ.Номенклатура, СтрокаТЧ.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры
